#+startup:      show2levels
#+title:        Garids Emacs Configuration
#+author:       Garid Z.
#+creator:      Garid Z.
#+email:        garidzorigoo@gmail.com
#+auto_tangle:  t
#+property:     header-args :tangle init.el
#+setupfile:    ~/.config/emacs/org-templates/level-0-xelatex-fonts-conf.org
#+options:      toc:t tags:nil  todo:t  tasks:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://orgmode.org/worg/style/worg.css"/>


** Website from org-roam directory
[[id:e7ee081e-a02b-4ab9-bccc-327a92bf2b09][create website from org-roam]]

#+begin_src emacs-lisp
(setq org-html-validation-link            nil ;; Don't show validation link
      org-html-head-include-scripts       nil ;; Use our own scripts
      org-html-head-include-default-style nil ;; Use our own styles
      ;;org-html-head "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" />"
      org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://orgmode.org/worg/style/worg.css\"/>"
      ;;org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://orgmode.org/worg/style/worg7.css\"/>"
      ;; org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://orgmode.org/worg/style/worg-zenburn.css\"/>"
      ;;org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://orgmode.org/worg/style/worg-classic.css\"/>"
      ;;org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://orgmode.org/worg/style/zenburn-emacs.css\"/>"
      ;;org-html-head "<link rel=\"stylesheet\" href=\"https://orgmode.org/worg/style/worg.css\" />"
      ;;org-html-head "<link rel=\"stylesheet\" href=\"https://gongzhitaao.org/orgcss/org.css\" />"
      )
#+end_src

#+RESULTS:
: <link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

#+begin_src emacs-lisp :exports code :results verbatim
(setq
 org-publish-project-alist
 `(("Pensieve: org -> html"
    :base-directory ,org-roam-directory
    ;; :base-directory "~/Pensieve/"
    :recursive t
    :publishing-function org-html-publish-to-html
    :publishing-directory ,(concat org-roam-directory "website")
    :exclude ".*daily/.*org"  ;;; for excluding -daily
    ;; :publishing-directory "/tmp/asdf"
    ;;:publishing-directory (concat org-roam-directory "website")
    ;; :section-numbers nil
    :section-numbers  org-export-with-section-numbers
    :with-toc         t
    :html_link_home  "index.html"
    ;; :html-preamble "This is just a test"
    :html-preamble "<div id=\"navbar\"> <ul>
  <div class=\"stork-wrapper\">
    <a href=\"/~zgarid/index.html\">Home</a>             &nbsp;
    <a href=\"..\">Up/Back</a>                           &nbsp;
    <a href=\"/~zgarid/meta-research.html\">Research</a> &nbsp;
    <a href=\"/~zgarid/meta-python.html\">Python</a>     &nbsp;
    <a href=\"/~zgarid/meta-cli.html\">CLI</a>           &nbsp;
    <a href=\"/~zgarid/meta-org.html\">Org-Mode</a>      &nbsp;
    <a href=\"/~zgarid/search.html\">Search</a>          &nbsp;
    <input data-stork=\"federalist\" class=\"stork-input\" />
    <div data-stork=\"federalist-output\" class=\"stork-output\"></div>
  </div>
</ul>
<hr>
</div>
<script src=\"https://files.stork-search.net/releases/v1.6.0/stork.js\"></script>
<script>
stork.register(
    'federalist', 'https://www.ep.sci.hokudai.ac.jp/~zgarid/garid_stork.st'
)
</script>
"
    ;; 
    ;; 'https://github.com/garid3000/testy/raw/master/garid_stork.st'
    ;; :html-divs ((preamble "header"  "preamble")
    ;;             (content   "main"   "content")
    ;;             (postamble "footer" "postamble"))

    )
   ;;:html_head "<link rel=\"stylesheet\" href=\"/home/garid/org.css\">"
   ;; not sure why above line doesn't change css of thml output
   ;; that's why I copied from
   ;;https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/
   ;; above


   ("Pensieve: od-imgs change position"
    :base-directory ,(concat org-roam-directory "od-imgs/")
    :base-extension "jpg\\|gif\\|png\\|svg"
    :recursive t
    ;;:publishing-directory "/ssh:user@host:~/html/images/"
    :publishing-directory ,(concat org-roam-directory "website/od-imgs")
    ;; :publishing-directory "/tmp/asdf/img"
    :publishing-function org-publish-attachment)

   ;; ("Pensieve: org -> txt"
   ;;  :base-directory ,org-roam-directory
   ;;  ;; :base-directory "~/Pensieve/"
   ;;  :recursive t
   ;;  :publishing-function org-ascii-export-to-ascii
   ;;  :publishing-directory ,(concat org-roam-directory "txt_for_stork")
   ;;  :exclude ".*daily/.*org"  ;;; for excluding -daily
   ;;  ;; :publishing-directory "/tmp/asdf"
   ;;  ;;:publishing-directory (concat org-roam-directory "website")
   ;;  ;; :section-numbers nil
   ;;  :section-numbers  nil
   ;;  ;; :with-toc         t
   ;;  )

   ;; ("Pensieve: org -> txt 2"
   ;;  :base-directory ,org-roam-directory
   ;;  ;; :base-directory "~/Pensieve/"
   ;;  :recursive t
   ;;  :publishing-function org-ascii-export-to-ascii
   ;;  :publishing-directory ,(concat org-roam-directory "txt_for_stork")
   ;;  :exclude ".*daily/.*org"  ;;; for excluding -daily
   ;;  ;; :publishing-directory "/tmp/asdf"
   ;;  ;;:publishing-directory (concat org-roam-directory "website")
   ;;  ;; :section-numbers nil
   ;;  :section-numbers  nil
   ;;  :with-toc         nil
   ;;  ;;:html_link_home  "index.html"
   ;;  )

   )
 )
#+end_src

#+RESULTS:
: (("Pensieve org -> html00" :base-directory "~/Pensieve" :publishing-function org-html-publish-to-html :publishing-directory "/tmp/garids_pensieve" :section-numbers nil :with-toc nil) ("Pensieve export imgs" :base-directory "~/Pensieve/od-imgs/" :base-extension "jpg\\|gif\\|png\\|svg" :recursive t :publishing-directory "/tmp/garids_pensieve/od-imgs" :publishing-function org-publish-attachment))

** COMMENT Indent bars
#+begin_src emacs-lisp
;; (use-package indent-bars
;;   :straight (indent-bars :type git :host github :repo "jdtsmith/indent-bars")
;;   :hook ((python-ts-mode) . indent-bars-mode)) 
#+end_src

#+begin_src emacs-lisp
(use-package indent-bars
  ;;:load-path "~/code/emacs/indent-bars"
  :straight (indent-bars :type git :host github :repo "jdtsmith/indent-bars")
  :custom
  (indent-bars-treesit-support t)
  (indent-bars-no-descend-string nil)
  (indent-bars-prefer-character "|")
  (indent-bars-treesit-ignore-blank-lines-types '("module"))
  (indent-bars-treesit-wrap '((python argument_list parameters ; for python, as an example
				      list list_comprehension
				      dictionary dictionary_comprehension
				      parenthesized_expression subscript)))
  :hook ((python-base-mode yaml-mode) . indent-bars-mode))
#+end_src

#+RESULTS:
| indent-bars-mode |

